{
  "id": "01BJG5GGVGTF1C407SE3XK01HJ",
  "date": "2017-06-13T10:25:58.000",
  "author": {
    "name": "Colton Fischer",
    "website": "http://www.peoplesoftmods.com"
  },
  "message": "Hello Bart.  Thank you for bringing this issue to my attention.  Unfortunately, I am not sure if there will be an easy fix for this.\r\n \r\nThis is due to a limitation in the amount of data that is presented in the client request that we parse in the event mapped code.  When a user does an open search and selects a row from the search record, the posted key fields (PSOPRDEFN_SRCH_OPRID for example) in the request message are going to be blank.  This is the reason for the blank value for the PSOPRDEFN_SRCH.OPRID field in your case.  The actual OPRID value for the row that the user clicks on is not exposed in the request message.  \r\n\r\nYou could possibly expand the code to log/examine the ICAction parameter.  This parameter will contain what appears to be the row number that the user clicked on after the open search.  The value for the ICAction parameter will look something like #ICRow0, #ICRow1, #ICRow2, etc. where the last digit seems to express the ith row of data that the user clicked after the search.  While this parameter does not contain the actual key data searched for, you may be able to use this information along with the posted partial key values to query to search record yourself in the code to extract the key values for the record that the user is viewing.\r\n\r\nUpdate:\r\n\r\nAfter some further investigation of the ICAction parameter, it seems that it has the value of #KEY in the event that the user provides search key(s) that are an exact match to a row in the search record.  Otherwise, it will have the #ICRow value when the user posts search key(s) that are not an exact match for to a row in the search record.\r\n\r\nI believe the code I provided in this post can definitely use some reworking!  I will be sure to share what I am able to get done.  If you are able to devise a way to overcome this issue, then I would be interested hearing.",
  "migrated_fields": {
    "email": "4d496aa46c2247876cdd9588b8128ea0"
  }
}